; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph2 - mode
	image1 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	infrared3 - mode
	Star0 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star4 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star9 - direction
	GroundStation11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star9)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 GroundStation10)
	(supports instrument5 image1)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation11)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Star6)
	(have_image Star12 thermograph2)
	(have_image Star13 image1)
	(have_image Star14 spectrograph4)
	(have_image Planet15 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
3. (turn_to satellite1 groundstation1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 6
4. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 6
5. (turn_to satellite1 star14 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star14)
   goals met: 0 of 6
6. (take_image satellite1 star14 instrument2 spectrograph4)
   added: (have_image star14 spectrograph4)
   goals met: 1 of 6
7. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 1 of 6
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 6
9. (turn_to satellite1 star12 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star12)
   goals met: 1 of 6
10. (turn_to satellite1 star3 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star3)
   goals met: 1 of 6
11. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 6
12. (turn_to satellite1 star12 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star12)
   goals met: 1 of 6
13. (take_image satellite1 star12 instrument3 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 2 of 6
14. (turn_to satellite1 star6 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star6)
   goals met: 3 of 6
15. (turn_to satellite0 star2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star2)
   goals met: 3 of 6
16. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 6
17. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 6
18. (turn_to satellite0 planet15 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet15)
   goals met: 3 of 6
19. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 4 of 6
20. (turn_to satellite0 groundstation1 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation1)
   goals met: 5 of 6
21. (turn_to satellite0 star13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star13)
   goals met: 4 of 6
22. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 5 of 6
23. (turn_to satellite0 groundstation1 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation1)
   goals met: 6 of 6
